/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        *self
    }
}
impl<T> ::std::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::std::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::std::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::std::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::std::cmp::Eq for __BindgenUnionField<T> {}
pub const NVSDK_NGX_VERSION_API_MACRO: u32 = 21;
pub const NVSDK_NGX_EParameter_Reserved00: &[u8; 3] = b"#\0\0";
pub const NVSDK_NGX_EParameter_SuperSampling_Available: &[u8; 3] = b"#\x01\0";

    NVSDK_NGX_Result_FAIL_Denied = 3134193681,
    NVSDK_NGX_Result_FAIL_NotImplemented = 3134193682,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Feature {
    NVSDK_NGX_Feature_Reserved0 = 0,
    NVSDK_NGX_Feature_SuperSampling = 1,
    NVSDK_NGX_Feature_InPainting = 2,
    NVSDK_NGX_Feature_ImageSuperResolution = 3,
    NVSDK_NGX_Feature_SlowMotion = 4,
    NVSDK_NGX_Feature_VideoSuperResolution = 5,
    NVSDK_NGX_Feature_Reserved1 = 6,
    NVSDK_NGX_Feature_Reserved2 = 7,
    NVSDK_NGX_Feature_Reserved3 = 8,
    NVSDK_NGX_Feature_ImageSignalProcessing = 9,
    NVSDK_NGX_Feature_DeepResolve = 10,
    NVSDK_NGX_Feature_FrameGeneration = 11,
    NVSDK_NGX_Feature_DeepDVC = 12,
    NVSDK_NGX_Feature_RayReconstruction = 13,
    NVSDK_NGX_Feature_Reserved14 = 14,
    NVSDK_NGX_Feature_Reserved15 = 15,
    NVSDK_NGX_Feature_Reserved16 = 16,
    NVSDK_NGX_Feature_Count = 17,
    NVSDK_NGX_Feature_Reserved_SDK = 32764,
    NVSDK_NGX_Feature_Reserved_Core = 32765,
    NVSDK_NGX_Feature_Reserved_Unknown = 32766,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Buffer_Format {
    NVSDK_NGX_Buffer_Format_Unknown = 0,
    NVSDK_NGX_Buffer_Format_RGB8UI = 1,
    NVSDK_NGX_Buffer_Format_RGB16F = 2,
    NVSDK_NGX_Buffer_Format_RGB32F = 3,
    NVSDK_NGX_Buffer_Format_RGBA8UI = 4,
    NVSDK_NGX_Buffer_Format_RGBA16F = 5,
    NVSDK_NGX_Buffer_Format_RGBA32F = 6,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_PerfQuality_Value {
    NVSDK_NGX_PerfQuality_Value_MaxPerf = 0,
    NVSDK_NGX_PerfQuality_Value_Balanced = 1,
    NVSDK_NGX_PerfQuality_Value_MaxQuality = 2,
    NVSDK_NGX_PerfQuality_Value_UltraPerformance = 3,
    NVSDK_NGX_PerfQuality_Value_UltraQuality = 4,
    NVSDK_NGX_PerfQuality_Value_DLAA = 5,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_RTX_Value {
    NVSDK_NGX_RTX_Value_Off = 0,
    NVSDK_NGX_RTX_Value_On = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_DLSS_Mode {
    NVSDK_NGX_DLSS_Mode_Off = 0,
    NVSDK_NGX_DLSS_Mode_DLSS_DLISP = 1,
    NVSDK_NGX_DLSS_Mode_DLISP_Only = 2,
    NVSDK_NGX_DLSS_Mode_DLSS = 3,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NVSDK_NGX_Handle {
    pub Id: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Handle() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_Handle> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Handle>(),
        4usize,
        "Size of NVSDK_NGX_Handle"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Handle>(),
        4usize,
        "Alignment of NVSDK_NGX_Handle"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Id) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Handle::Id"
    );
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_GPU_Arch {
    NVSDK_NGX_GPU_Arch_NotSupported = 0,
    NVSDK_NGX_GPU_Arch_Volta = 320,
    NVSDK_NGX_GPU_Arch_Turing = 352,
    NVSDK_NGX_GPU_Arch_Ampere = 368,
    NVSDK_NGX_GPU_Arch_Ada = 400,
    NVSDK_NGX_GPU_Arch_Hopper = 384,
    NVSDK_NGX_GPU_Arch_Blackwell = 416,
    NVSDK_NGX_GPU_Arch_Blackwell2 = 432,
    NVSDK_NGX_GPU_Arch_Unknown = 134217727,
}
impl NVSDK_NGX_DLSS_Feature_Flags {
    pub const NVSDK_NGX_DLSS_Feature_Flags_IsInvalid: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(-2147483648);
    pub const NVSDK_NGX_DLSS_Feature_Flags_None: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(0);
    pub const NVSDK_NGX_DLSS_Feature_Flags_IsHDR: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(1);
    pub const NVSDK_NGX_DLSS_Feature_Flags_MVLowRes: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(2);
    pub const NVSDK_NGX_DLSS_Feature_Flags_MVJittered: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(4);
    pub const NVSDK_NGX_DLSS_Feature_Flags_DepthInverted: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(8);
    pub const NVSDK_NGX_DLSS_Feature_Flags_Reserved_0: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(16);
    pub const NVSDK_NGX_DLSS_Feature_Flags_DoSharpening: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(32);
    pub const NVSDK_NGX_DLSS_Feature_Flags_AutoExposure: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(64);
    pub const NVSDK_NGX_DLSS_Feature_Flags_AlphaUpscaling: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(128);
}
impl ::std::ops::BitOr<NVSDK_NGX_DLSS_Feature_Flags> for NVSDK_NGX_DLSS_Feature_Flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        NVSDK_NGX_DLSS_Feature_Flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for NVSDK_NGX_DLSS_Feature_Flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: NVSDK_NGX_DLSS_Feature_Flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<NVSDK_NGX_DLSS_Feature_Flags> for NVSDK_NGX_DLSS_Feature_Flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        NVSDK_NGX_DLSS_Feature_Flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for NVSDK_NGX_DLSS_Feature_Flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: NVSDK_NGX_DLSS_Feature_Flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct NVSDK_NGX_DLSS_Feature_Flags(pub ::std::os::raw::c_int);
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_ToneMapperType {
    NVSDK_NGX_TONEMAPPER_STRING = 0,
    NVSDK_NGX_TONEMAPPER_REINHARD = 1,
    NVSDK_NGX_TONEMAPPER_ONEOVERLUMA = 2,
    NVSDK_NGX_TONEMAPPER_ACES = 3,
    NVSDK_NGX_TONEMAPPERTYPE_NUM = 4,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_GBufferType {
    NVSDK_NGX_GBUFFER_ALBEDO = 0,
    NVSDK_NGX_GBUFFER_ROUGHNESS = 1,
    NVSDK_NGX_GBUFFER_METALLIC = 2,
    NVSDK_NGX_GBUFFER_SPECULAR = 3,
    NVSDK_NGX_GBUFFER_SUBSURFACE = 4,
    NVSDK_NGX_GBUFFER_NORMALS = 5,
    NVSDK_NGX_GBUFFER_SHADINGMODELID = 6,
    NVSDK_NGX_GBUFFER_MATERIALID = 7,
    NVSDK_NGX_GBUFFER_SPECULAR_ALBEDO = 8,
    NVSDK_NGX_GBUFFER_INDIRECT_ALBEDO = 9,
    NVSDK_NGX_GBUFFER_SPECULAR_MVEC = 10,
    NVSDK_NGX_GBUFFER_DISOCCL_MASK = 11,
    NVSDK_NGX_GBUFFER_EMISSIVE = 12,
    NVSDK_NGX_GBUFFERTYPE_NUM = 16,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NVSDK_NGX_Coordinates {
    pub X: ::std::os::raw::c_uint,
    pub Y: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Coordinates() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_Coordinates> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Coordinates>(),
        8usize,
        "Size of NVSDK_NGX_Coordinates"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Coordinates>(),
        4usize,
        "Alignment of NVSDK_NGX_Coordinates"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).X) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Coordinates::X"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Y) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_Coordinates::Y"
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NVSDK_NGX_Dimensions {
    pub Width: ::std::os::raw::c_uint,
    pub Height: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Dimensions() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_Dimensions> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Dimensions>(),
        8usize,
        "Size of NVSDK_NGX_Dimensions"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Dimensions>(),
        4usize,
        "Alignment of NVSDK_NGX_Dimensions"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Width) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Dimensions::Width"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Height) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_Dimensions::Height"
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NVSDK_NGX_PrecisionInfo {
    pub IsLowPrecision: ::std::os::raw::c_uint,
    pub Bias: f32,
    pub Scale: f32,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_PrecisionInfo() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_PrecisionInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_PrecisionInfo>(),
        12usize,
        "Size of NVSDK_NGX_PrecisionInfo"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_PrecisionInfo>(),
        4usize,
        "Alignment of NVSDK_NGX_PrecisionInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsLowPrecision) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_PrecisionInfo::IsLowPrecision"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Bias) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_PrecisionInfo::Bias"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Scale) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_PrecisionInfo::Scale"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_PathListInfo {
    pub Path: *const *const u32,
    pub Length: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_PathListInfo() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_PathListInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_PathListInfo>(),
        16usize,
        "Size of NVSDK_NGX_PathListInfo"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_PathListInfo>(),
        8usize,
        "Alignment of NVSDK_NGX_PathListInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Path) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_PathListInfo::Path"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_PathListInfo::Length"
    );
}
impl Default for NVSDK_NGX_PathListInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Logging_Level {
    NVSDK_NGX_LOGGING_LEVEL_OFF = 0,
    NVSDK_NGX_LOGGING_LEVEL_ON = 1,
    NVSDK_NGX_LOGGING_LEVEL_VERBOSE = 2,
    NVSDK_NGX_LOGGING_LEVEL_NUM = 3,
}
pub type NVSDK_NGX_AppLogCallback = ::std::option::Option<
    unsafe extern "C" fn(
        message: *const ::std::os::raw::c_char,
        loggingLevel: NVSDK_NGX_Logging_Level,
        sourceComponent: NVSDK_NGX_Feature,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_LoggingInfo {
    pub LoggingCallback: NVSDK_NGX_AppLogCallback,
    pub MinimumLoggingLevel: NVSDK_NGX_Logging_Level,
    pub DisableOtherLoggingSinks: bool,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_LoggingInfo() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_LoggingInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_LoggingInfo>(),
        16usize,
        "Size of NVSDK_NGX_LoggingInfo"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_LoggingInfo>(),
        8usize,
        "Alignment of NVSDK_NGX_LoggingInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LoggingCallback) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_LoggingInfo::LoggingCallback"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinimumLoggingLevel) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_LoggingInfo::MinimumLoggingLevel"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DisableOtherLoggingSinks) as usize - ptr as usize },
        12usize,
        "Offset of field: NVSDK_NGX_LoggingInfo::DisableOtherLoggingSinks"
    );
}
impl Default for NVSDK_NGX_LoggingInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_FeatureCommonInfo {
    pub PathListInfo: NVSDK_NGX_PathListInfo,
    pub InternalData: *mut NVSDK_NGX_FeatureCommonInfo_Internal,
    pub LoggingInfo: NVSDK_NGX_LoggingInfo,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_FeatureCommonInfo() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_FeatureCommonInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_FeatureCommonInfo>(),
        40usize,
        "Size of NVSDK_NGX_FeatureCommonInfo"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_FeatureCommonInfo>(),
        8usize,
        "Alignment of NVSDK_NGX_FeatureCommonInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PathListInfo) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_FeatureCommonInfo::PathListInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InternalData) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_FeatureCommonInfo::InternalData"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LoggingInfo) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_FeatureCommonInfo::LoggingInfo"
    );
}
impl Default for NVSDK_NGX_FeatureCommonInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Resource_VK_Type {
    NVSDK_NGX_RESOURCE_VK_TYPE_VK_IMAGEVIEW = 0,
    NVSDK_NGX_RESOURCE_VK_TYPE_VK_BUFFER = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Opt_Level {
    NVSDK_NGX_OPT_LEVEL_UNDEFINED = 0,
    NVSDK_NGX_OPT_LEVEL_DEBUG = 20,
    NVSDK_NGX_OPT_LEVEL_DEVELOP = 30,
    NVSDK_NGX_OPT_LEVEL_RELEASE = 40,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_EngineType {
    NVSDK_NGX_ENGINE_TYPE_CUSTOM = 0,
    NVSDK_NGX_ENGINE_TYPE_UNREAL = 1,
    NVSDK_NGX_ENGINE_TYPE_UNITY = 2,
    NVSDK_NGX_ENGINE_TYPE_OMNIVERSE = 3,
    NVSDK_NGX_ENGINE_COUNT = 4,
}
impl NVSDK_NGX_Feature_Support_Result {
    pub const NVSDK_NGX_FeatureSupportResult_Supported: NVSDK_NGX_Feature_Support_Result =
        NVSDK_NGX_Feature_Support_Result(0);
    pub const NVSDK_NGX_FeatureSupportResult_CheckNotPresent: NVSDK_NGX_Feature_Support_Result =
        NVSDK_NGX_Feature_Support_Result(1);
    pub const NVSDK_NGX_FeatureSupportResult_DriverVersionUnsupported:
        NVSDK_NGX_Feature_Support_Result = NVSDK_NGX_Feature_Support_Result(2);
    pub const NVSDK_NGX_FeatureSupportResult_AdapterUnsupported: NVSDK_NGX_Feature_Support_Result =
        NVSDK_NGX_Feature_Support_Result(4);
    pub const NVSDK_NGX_FeatureSupportResult_OSVersionBelowMinimumSupported:
        NVSDK_NGX_Feature_Support_Result = NVSDK_NGX_Feature_Support_Result(8);
    pub const NVSDK_NGX_FeatureSupportResult_NotImplemented: NVSDK_NGX_Feature_Support_Result =
        NVSDK_NGX_Feature_Support_Result(16);
}
impl ::std::ops::BitOr<NVSDK_NGX_Feature_Support_Result> for NVSDK_NGX_Feature_Support_Result {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        NVSDK_NGX_Feature_Support_Result(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for NVSDK_NGX_Feature_Support_Result {
    #[inline]
    fn bitor_assign(&mut self, rhs: NVSDK_NGX_Feature_Support_Result) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<NVSDK_NGX_Feature_Support_Result> for NVSDK_NGX_Feature_Support_Result {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        NVSDK_NGX_Feature_Support_Result(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for NVSDK_NGX_Feature_Support_Result {
    #[inline]
    fn bitand_assign(&mut self, rhs: NVSDK_NGX_Feature_Support_Result) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct NVSDK_NGX_Feature_Support_Result(pub ::std::os::raw::c_uint);
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Application_Identifier_Type {
    NVSDK_NGX_Application_Identifier_Type_Application_Id = 0,
    NVSDK_NGX_Application_Identifier_Type_Project_Id = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_ProjectIdDescription {
    pub ProjectId: *const ::std::os::raw::c_char,
    pub EngineType: NVSDK_NGX_EngineType,
    pub EngineVersion: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_ProjectIdDescription() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_ProjectIdDescription> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_ProjectIdDescription>(),
        24usize,
        "Size of NVSDK_NGX_ProjectIdDescription"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_ProjectIdDescription>(),
        8usize,
        "Alignment of NVSDK_NGX_ProjectIdDescription"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProjectId) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_ProjectIdDescription::ProjectId"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EngineType) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_ProjectIdDescription::EngineType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EngineVersion) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_ProjectIdDescription::EngineVersion"
    );
}
impl Default for NVSDK_NGX_ProjectIdDescription {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NVSDK_NGX_Application_Identifier {
    pub IdentifierType: NVSDK_NGX_Application_Identifier_Type,
    pub v: v,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v {
    pub ProjectDesc: NVSDK_NGX_ProjectIdDescription,
    pub ApplicationId: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_v() {
    const UNINIT: ::std::mem::MaybeUninit<v> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(::std::mem::size_of::<v>(), 24usize, "Size of v");
    assert_eq!(::std::mem::align_of::<v>(), 8usize, "Alignment of v");
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProjectDesc) as usize - ptr as usize },
        0usize,
        "Offset of field: v::ProjectDesc"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApplicationId) as usize - ptr as usize },
        0usize,
        "Offset of field: v::ApplicationId"
    );
}
impl Default for v {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for v {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "v {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Application_Identifier() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_Application_Identifier> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Application_Identifier>(),
        32usize,
        "Size of NVSDK_NGX_Application_Identifier"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Application_Identifier>(),
        8usize,
        "Alignment of NVSDK_NGX_Application_Identifier"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IdentifierType) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Application_Identifier::IdentifierType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_Application_Identifier::v"
    );
}
impl Default for NVSDK_NGX_Application_Identifier {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for NVSDK_NGX_Application_Identifier {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "NVSDK_NGX_Application_Identifier {{ IdentifierType: {:?}, v: {:?} }}",
            self.IdentifierType, self.v
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NVSDK_NGX_FeatureDiscoveryInfo {
    pub SDKVersion: NVSDK_NGX_Version,
    pub FeatureID: NVSDK_NGX_Feature,
    pub Identifier: NVSDK_NGX_Application_Identifier,
    pub ApplicationDataPath: *const u32,
    pub FeatureInfo: *const NVSDK_NGX_FeatureCommonInfo,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_FeatureDiscoveryInfo() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_FeatureDiscoveryInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_FeatureDiscoveryInfo>(),
        56usize,
        "Size of NVSDK_NGX_FeatureDiscoveryInfo"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_FeatureDiscoveryInfo>(),
        8usize,
        "Alignment of NVSDK_NGX_FeatureDiscoveryInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SDKVersion) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_FeatureDiscoveryInfo::SDKVersion"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FeatureID) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_FeatureDiscoveryInfo::FeatureID"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Identifier) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_FeatureDiscoveryInfo::Identifier"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApplicationDataPath) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_FeatureDiscoveryInfo::ApplicationDataPath"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FeatureInfo) as usize - ptr as usize },
        48usize,
        "Offset of field: NVSDK_NGX_FeatureDiscoveryInfo::FeatureInfo"
    );
}
impl Default for NVSDK_NGX_FeatureDiscoveryInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for NVSDK_NGX_FeatureDiscoveryInfo {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "NVSDK_NGX_FeatureDiscoveryInfo {{ SDKVersion: {:?}, FeatureID: {:?}, Identifier: {:?}, ApplicationDataPath: {:?}, FeatureInfo: {:?} }}" , self . SDKVersion , self . FeatureID , self . Identifier , self . ApplicationDataPath , self . FeatureInfo)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_FeatureRequirement {
    pub FeatureSupported: NVSDK_NGX_Feature_Support_Result,
    pub MinHWArchitecture: ::std::os::raw::c_uint,
    pub MinOSVersion: [::std::os::raw::c_char; 255usize],
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_FeatureRequirement() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_FeatureRequirement> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_FeatureRequirement>(),
        264usize,
        "Size of NVSDK_NGX_FeatureRequirement"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_FeatureRequirement>(),
        4usize,
        "Alignment of NVSDK_NGX_FeatureRequirement"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FeatureSupported) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_FeatureRequirement::FeatureSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinHWArchitecture) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_FeatureRequirement::MinHWArchitecture"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinOSVersion) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_FeatureRequirement::MinOSVersion"
    );
}
impl Default for NVSDK_NGX_FeatureRequirement {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_Feature_Create_Params {
    pub InWidth: ::std::os::raw::c_uint,
    pub InHeight: ::std::os::raw::c_uint,
    pub InTargetWidth: ::std::os::raw::c_uint,
    pub InTargetHeight: ::std::os::raw::c_uint,
    #[doc = " OPTIONAL"]
    pub InPerfQualityValue: NVSDK_NGX_PerfQuality_Value,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Feature_Create_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_Feature_Create_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Feature_Create_Params>(),
        20usize,
        "Size of NVSDK_NGX_Feature_Create_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Feature_Create_Params>(),
        4usize,
        "Alignment of NVSDK_NGX_Feature_Create_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InWidth) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Feature_Create_Params::InWidth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InHeight) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_Feature_Create_Params::InHeight"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InTargetWidth) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_Feature_Create_Params::InTargetWidth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InTargetHeight) as usize - ptr as usize },
        12usize,
        "Offset of field: NVSDK_NGX_Feature_Create_Params::InTargetHeight"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InPerfQualityValue) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_Feature_Create_Params::InPerfQualityValue"
    );
}
impl Default for NVSDK_NGX_Feature_Create_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_DLSS_Create_Params {
    pub Feature: NVSDK_NGX_Feature_Create_Params,
    #[doc = " OPTIONAL"]
    pub InFeatureCreateFlags: ::std::os::raw::c_int,
    pub InEnableOutputSubrects: bool,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_DLSS_Create_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_DLSS_Create_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_DLSS_Create_Params>(),
        28usize,
        "Size of NVSDK_NGX_DLSS_Create_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_DLSS_Create_Params>(),
        4usize,
        "Alignment of NVSDK_NGX_DLSS_Create_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Feature) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_DLSS_Create_Params::Feature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InFeatureCreateFlags) as usize - ptr as usize },
        20usize,
        "Offset of field: NVSDK_NGX_DLSS_Create_Params::InFeatureCreateFlags"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InEnableOutputSubrects) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_DLSS_Create_Params::InEnableOutputSubrects"
    );
}
impl Default for NVSDK_NGX_DLSS_Create_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_DLDenoise_Create_Params {
    pub Feature: NVSDK_NGX_Feature_Create_Params,
    #[doc = " OPTIONAL"]
    pub InFeatureCreateFlags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_DLDenoise_Create_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_DLDenoise_Create_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_DLDenoise_Create_Params>(),
        24usize,
        "Size of NVSDK_NGX_DLDenoise_Create_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_DLDenoise_Create_Params>(),
        4usize,
        "Alignment of NVSDK_NGX_DLDenoise_Create_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Feature) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_DLDenoise_Create_Params::Feature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InFeatureCreateFlags) as usize - ptr as usize },
        20usize,
        "Offset of field: NVSDK_NGX_DLDenoise_Create_Params::InFeatureCreateFlags"
    );
}
impl Default for NVSDK_NGX_DLDenoise_Create_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct NVSDK_NGX_Parameter__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_Parameter {
    pub vtable_: *const NVSDK_NGX_Parameter__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Parameter() {
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Parameter>(),
        8usize,
        "Size of NVSDK_NGX_Parameter"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Parameter>(),
        8usize,
        "Alignment of NVSDK_NGX_Parameter"
    );
}
impl Default for NVSDK_NGX_Parameter {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type PFN_NVSDK_NGX_Parameter_SetULL = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: ::std::os::raw::c_ulonglong,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetULL(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: ::std::os::raw::c_ulonglong,
    );
}
pub type PFN_NVSDK_NGX_Parameter_SetF = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: f32,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetF(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: f32,
    );
}
pub type PFN_NVSDK_NGX_Parameter_SetD = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: f64,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetD(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: f64,
    );
}
pub type PFN_NVSDK_NGX_Parameter_SetUI = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: ::std::os::raw::c_uint,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetUI(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: ::std::os::raw::c_uint,
    );
}
pub type PFN_NVSDK_NGX_Parameter_SetI = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: ::std::os::raw::c_int,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetI(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: ::std::os::raw::c_int,
    );
}
pub type PFN_NVSDK_NGX_Parameter_SetVoidPointer = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetVoidPointer(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: *mut ::std::os::raw::c_void,
    );
}
pub type PFN_NVSDK_NGX_Parameter_GetULL = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut ::std::os::raw::c_ulonglong,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetULL(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut ::std::os::raw::c_ulonglong,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_Parameter_GetF = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut f32,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetF(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut f32,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_Parameter_GetD = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut f64,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetD(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut f64,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_Parameter_GetUI = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut ::std::os::raw::c_uint,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetUI(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut ::std::os::raw::c_uint,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_Parameter_GetI = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut ::std::os::raw::c_int,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetI(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut ::std::os::raw::c_int,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_Parameter_GetVoidPointer = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut *mut ::std::os::raw::c_void,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetVoidPointer(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut *mut ::std::os::raw::c_void,
    ) -> NVSDK_NGX_Result;
}
#[repr(C)]
pub struct NVSDK_NGX_ImageViewInfo_VK {
    pub ImageView: VkImageView,
    pub Image: VkImage,
    pub SubresourceRange: VkImageSubresourceRange,
    pub Format: VkFormat,
    pub Width: ::std::os::raw::c_uint,
    pub Height: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_ImageViewInfo_VK() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_ImageViewInfo_VK> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_ImageViewInfo_VK>(),
        48usize,
        "Size of NVSDK_NGX_ImageViewInfo_VK"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_ImageViewInfo_VK>(),
        8usize,
        "Alignment of NVSDK_NGX_ImageViewInfo_VK"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ImageView) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_ImageViewInfo_VK::ImageView"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Image) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_ImageViewInfo_VK::Image"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SubresourceRange) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_ImageViewInfo_VK::SubresourceRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Format) as usize - ptr as usize },
        36usize,
        "Offset of field: NVSDK_NGX_ImageViewInfo_VK::Format"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Width) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_ImageViewInfo_VK::Width"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Height) as usize - ptr as usize },
        44usize,
        "Offset of field: NVSDK_NGX_ImageViewInfo_VK::Height"
    );
}
impl Default for NVSDK_NGX_ImageViewInfo_VK {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for NVSDK_NGX_ImageViewInfo_VK {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "NVSDK_NGX_ImageViewInfo_VK {{ Width: {:?}, Height: {:?} }}",
            self.Width, self.Height
        )
    }
}
#[repr(C)]
pub struct NVSDK_NGX_BufferInfo_VK {
    pub Buffer: VkBuffer,
    pub SizeInBytes: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_BufferInfo_VK() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_BufferInfo_VK> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_BufferInfo_VK>(),
        16usize,
        "Size of NVSDK_NGX_BufferInfo_VK"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_BufferInfo_VK>(),
        8usize,
        "Alignment of NVSDK_NGX_BufferInfo_VK"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Buffer) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_BufferInfo_VK::Buffer"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SizeInBytes) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_BufferInfo_VK::SizeInBytes"
    );
}
impl Default for NVSDK_NGX_BufferInfo_VK {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for NVSDK_NGX_BufferInfo_VK {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "NVSDK_NGX_BufferInfo_VK {{ SizeInBytes: {:?} }}",
            self.SizeInBytes
        )
    }
}
#[repr(C)]
pub struct NVSDK_NGX_Resource_VK {
    pub Resource: NVSDK_NGX_Resource_VK__bindgen_ty_1,
    pub Type: NVSDK_NGX_Resource_VK_Type,
    pub ReadWrite: bool,
}
#[repr(C)]
pub struct NVSDK_NGX_Resource_VK__bindgen_ty_1 {
    pub ImageViewInfo: __BindgenUnionField<NVSDK_NGX_ImageViewInfo_VK>,
    pub BufferInfo: __BindgenUnionField<NVSDK_NGX_BufferInfo_VK>,
    pub bindgen_union_field: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Resource_VK__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_Resource_VK__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Resource_VK__bindgen_ty_1>(),
        48usize,
        "Size of NVSDK_NGX_Resource_VK__bindgen_ty_1"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Resource_VK__bindgen_ty_1>(),
        8usize,
        "Alignment of NVSDK_NGX_Resource_VK__bindgen_ty_1"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ImageViewInfo) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Resource_VK__bindgen_ty_1::ImageViewInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BufferInfo) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Resource_VK__bindgen_ty_1::BufferInfo"
    );
}
impl Default for NVSDK_NGX_Resource_VK__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for NVSDK_NGX_Resource_VK__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "NVSDK_NGX_Resource_VK__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Resource_VK() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_Resource_VK> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Resource_VK>(),
        56usize,
        "Size of NVSDK_NGX_Resource_VK"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Resource_VK>(),
        8usize,
        "Alignment of NVSDK_NGX_Resource_VK"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Resource) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Resource_VK::Resource"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        48usize,
        "Offset of field: NVSDK_NGX_Resource_VK::Type"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReadWrite) as usize - ptr as usize },
        52usize,
        "Offset of field: NVSDK_NGX_Resource_VK::ReadWrite"
    );
}
impl Default for NVSDK_NGX_Resource_VK {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for NVSDK_NGX_Resource_VK {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "NVSDK_NGX_Resource_VK {{ Resource: {:?}, Type: {:?}, ReadWrite: {:?} }}",
            self.Resource, self.Type, self.ReadWrite
        )
    }
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_RequiredExtensions(
        OutInstanceExtCount: *mut ::std::os::raw::c_uint,
        OutInstanceExts: *mut *mut *const ::std::os::raw::c_char,
        OutDeviceExtCount: *mut ::std::os::raw::c_uint,
        OutDeviceExts: *mut *mut *const ::std::os::raw::c_char,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_Init(
        InApplicationId: ::std::os::raw::c_ulonglong,
        InApplicationDataPath: *const u32,
        InInstance: VkInstance,
        InPD: VkPhysicalDevice,
        InDevice: VkDevice,
        InGIPA: PFN_vkGetInstanceProcAddr,
        InGDPA: PFN_vkGetDeviceProcAddr,
        InFeatureInfo: *const NVSDK_NGX_FeatureCommonInfo,
        InSDKVersion: NVSDK_NGX_Version,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_Init_with_ProjectID(
        InProjectId: *const ::std::os::raw::c_char,
        InEngineType: NVSDK_NGX_EngineType,
        InEngineVersion: *const ::std::os::raw::c_char,
        InApplicationDataPath: *const u32,
        InInstance: VkInstance,
        InPD: VkPhysicalDevice,
        InDevice: VkDevice,
        InGIPA: PFN_vkGetInstanceProcAddr,
        InGDPA: PFN_vkGetDeviceProcAddr,
        InFeatureInfo: *const NVSDK_NGX_FeatureCommonInfo,
        InSDKVersion: NVSDK_NGX_Version,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_Shutdown1(InDevice: VkDevice) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_AllocateParameters(
        OutParameters: *mut *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_GetCapabilityParameters(
        OutParameters: *mut *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_DestroyParameters(
        InParameters: *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_GetScratchBufferSize(
        InFeatureId: NVSDK_NGX_Feature,
        InParameters: *const NVSDK_NGX_Parameter,
        OutSizeInBytes: *mut usize,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_CreateFeature(
        InCmdBuffer: VkCommandBuffer,
        InFeatureID: NVSDK_NGX_Feature,
        InParameters: *mut NVSDK_NGX_Parameter,
        OutHandle: *mut *mut NVSDK_NGX_Handle,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_CreateFeature1(
        InDevice: VkDevice,
        InCmdList: VkCommandBuffer,
        InFeatureID: NVSDK_NGX_Feature,
        InParameters: *mut NVSDK_NGX_Parameter,
        OutHandle: *mut *mut NVSDK_NGX_Handle,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_ReleaseFeature(InHandle: *mut NVSDK_NGX_Handle) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_GetFeatureRequirements(
        Instance: VkInstance,
        PhysicalDevice: VkPhysicalDevice,
        FeatureDiscoveryInfo: *const NVSDK_NGX_FeatureDiscoveryInfo,
        OutSupported: *mut NVSDK_NGX_FeatureRequirement,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_GetFeatureInstanceExtensionRequirements(
        FeatureDiscoveryInfo: *const NVSDK_NGX_FeatureDiscoveryInfo,
        OutExtensionCount: *mut u32,
        OutExtensionProperties: *mut *mut VkExtensionProperties,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_VULKAN_GetFeatureDeviceExtensionRequirements(
        Instance: VkInstance,
        PhysicalDevice: VkPhysicalDevice,
        FeatureDiscoveryInfo: *const NVSDK_NGX_FeatureDiscoveryInfo,
        OutExtensionCount: *mut u32,
        OutExtensionProperties: *mut *mut VkExtensionProperties,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_ProgressCallback =
    ::std::option::Option<unsafe extern "C" fn(InCurrentProgress: f32, OutShouldCancel: *mut bool)>;
extern "C" {
    pub fn NVSDK_NGX_VULKAN_EvaluateFeature(
        InCmdList: VkCommandBuffer,
        InFeatureHandle: *const NVSDK_NGX_Handle,
        InParameters: *const NVSDK_NGX_Parameter,
        InCallback: PFN_NVSDK_NGX_ProgressCallback,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_ProgressCallback_C =
    ::std::option::Option<unsafe extern "C" fn(InCurrentProgress: f32, OutShouldCancel: *mut bool)>;
extern "C" {
    pub fn NVSDK_NGX_VULKAN_EvaluateFeature_C(
        InCmdList: VkCommandBuffer,
        InFeatureHandle: *const NVSDK_NGX_Handle,
        InParameters: *const NVSDK_NGX_Parameter,
        InCallback: PFN_NVSDK_NGX_ProgressCallback_C,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn GetNGXResultAsString(InNGXResult: NVSDK_NGX_Result) -> *const u32;
}
extern "C" {
    pub fn NVSDK_NGX_UpdateFeature(
        ApplicationId: *const NVSDK_NGX_Application_Identifier,
        FeatureID: NVSDK_NGX_Feature,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_DLSS_GetStatsCallback = ::std::option::Option<
    unsafe extern "C" fn(InParams: *mut NVSDK_NGX_Parameter) -> NVSDK_NGX_Result,
>;
pub type PFN_NVSDK_NGX_DLSS_GetOptimalSettingsCallback = ::std::option::Option<
    unsafe extern "C" fn(InParams: *mut NVSDK_NGX_Parameter) -> NVSDK_NGX_Result,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_VK_Feature_Eval_Params {
    pub pInColor: *mut NVSDK_NGX_Resource_VK,
    pub pInOutput: *mut NVSDK_NGX_Resource_VK,
    #[doc = " OPTIONAL for DLSS"]
    pub InSharpness: f32,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_VK_Feature_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_VK_Feature_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_VK_Feature_Eval_Params>(),
        24usize,
        "Size of NVSDK_NGX_VK_Feature_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_VK_Feature_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_VK_Feature_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColor) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_VK_Feature_Eval_Params::pInColor"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInOutput) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_VK_Feature_Eval_Params::pInOutput"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InSharpness) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_VK_Feature_Eval_Params::InSharpness"
    );
}
impl Default for NVSDK_NGX_VK_Feature_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_VK_GBuffer {
    pub pInAttrib: [*mut NVSDK_NGX_Resource_VK; 16usize],
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_VK_GBuffer() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_VK_GBuffer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_VK_GBuffer>(),
        128usize,
        "Size of NVSDK_NGX_VK_GBuffer"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_VK_GBuffer>(),
        8usize,
        "Alignment of NVSDK_NGX_VK_GBuffer"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInAttrib) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_VK_GBuffer::pInAttrib"
    );
}
impl Default for NVSDK_NGX_VK_GBuffer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NVSDK_NGX_Coordinates_VK {
    pub X: ::std::os::raw::c_uint,
    pub Y: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Coordinates_VK() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_Coordinates_VK> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Coordinates_VK>(),
        8usize,
        "Size of NVSDK_NGX_Coordinates_VK"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Coordinates_VK>(),
        4usize,
        "Alignment of NVSDK_NGX_Coordinates_VK"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).X) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Coordinates_VK::X"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Y) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_Coordinates_VK::Y"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_VK_DLSS_Eval_Params {
    pub Feature: NVSDK_NGX_VK_Feature_Eval_Params,
    pub pInDepth: *mut NVSDK_NGX_Resource_VK,
    pub pInMotionVectors: *mut NVSDK_NGX_Resource_VK,
    pub InJitterOffsetX: f32,
    pub InJitterOffsetY: f32,
    pub InRenderSubrectDimensions: NVSDK_NGX_Dimensions,
    #[doc = " OPTIONAL - leave to 0/0.0f if unused"]
    pub InReset: ::std::os::raw::c_int,
    pub InMVScaleX: f32,
    pub InMVScaleY: f32,
    pub pInTransparencyMask: *mut NVSDK_NGX_Resource_VK,
    pub pInExposureTexture: *mut NVSDK_NGX_Resource_VK,
    pub pInBiasCurrentColorMask: *mut NVSDK_NGX_Resource_VK,
    pub InColorSubrectBase: NVSDK_NGX_Coordinates,
    pub InDepthSubrectBase: NVSDK_NGX_Coordinates,
    pub InMVSubrectBase: NVSDK_NGX_Coordinates,
    pub InTranslucencySubrectBase: NVSDK_NGX_Coordinates,
    pub InBiasCurrentColorSubrectBase: NVSDK_NGX_Coordinates,
    pub InOutputSubrectBase: NVSDK_NGX_Coordinates,
    pub InPreExposure: f32,
    pub InExposureScale: f32,
    pub InIndicatorInvertXAxis: ::std::os::raw::c_int,
    pub InIndicatorInvertYAxis: ::std::os::raw::c_int,
    #[doc = " OPTIONAL - only for research purposes"]
    pub GBufferSurface: NVSDK_NGX_VK_GBuffer,
    pub InToneMapperType: NVSDK_NGX_ToneMapperType,
    pub pInMotionVectors3D: *mut NVSDK_NGX_Resource_VK,
    pub pInIsParticleMask: *mut NVSDK_NGX_Resource_VK,
    pub pInAnimatedTextureMask: *mut NVSDK_NGX_Resource_VK,
    pub pInDepthHighRes: *mut NVSDK_NGX_Resource_VK,
    pub pInPositionViewSpace: *mut NVSDK_NGX_Resource_VK,
    pub InFrameTimeDeltaInMsec: f32,
    pub pInRayTracingHitDistance: *mut NVSDK_NGX_Resource_VK,
    pub pInMotionVectorsReflections: *mut NVSDK_NGX_Resource_VK,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_VK_DLSS_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_VK_DLSS_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_VK_DLSS_Eval_Params>(),
        360usize,
        "Size of NVSDK_NGX_VK_DLSS_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_VK_DLSS_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_VK_DLSS_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Feature) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::Feature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDepth) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::pInDepth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectors) as usize - ptr as usize },
        32usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::pInMotionVectors"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InJitterOffsetX) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InJitterOffsetX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InJitterOffsetY) as usize - ptr as usize },
        44usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InJitterOffsetY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRenderSubrectDimensions) as usize - ptr as usize },
        48usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InRenderSubrectDimensions"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InReset) as usize - ptr as usize },
        56usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InReset"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVScaleX) as usize - ptr as usize },
        60usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InMVScaleX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVScaleY) as usize - ptr as usize },
        64usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InMVScaleY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInTransparencyMask) as usize - ptr as usize },
        72usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::pInTransparencyMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInExposureTexture) as usize - ptr as usize },
        80usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::pInExposureTexture"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInBiasCurrentColorMask) as usize - ptr as usize },
        88usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::pInBiasCurrentColorMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InColorSubrectBase) as usize - ptr as usize },
        96usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InColorSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InDepthSubrectBase) as usize - ptr as usize },
        104usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InDepthSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVSubrectBase) as usize - ptr as usize },
        112usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InMVSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InTranslucencySubrectBase) as usize - ptr as usize },
        120usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InTranslucencySubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InBiasCurrentColorSubrectBase) as usize - ptr as usize
        },
        128usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InBiasCurrentColorSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InOutputSubrectBase) as usize - ptr as usize },
        136usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InOutputSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InPreExposure) as usize - ptr as usize },
        144usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InPreExposure"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InExposureScale) as usize - ptr as usize },
        148usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InExposureScale"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InIndicatorInvertXAxis) as usize - ptr as usize },
        152usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InIndicatorInvertXAxis"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InIndicatorInvertYAxis) as usize - ptr as usize },
        156usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InIndicatorInvertYAxis"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GBufferSurface) as usize - ptr as usize },
        160usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::GBufferSurface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InToneMapperType) as usize - ptr as usize },
        288usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InToneMapperType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectors3D) as usize - ptr as usize },
        296usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::pInMotionVectors3D"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInIsParticleMask) as usize - ptr as usize },
        304usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::pInIsParticleMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInAnimatedTextureMask) as usize - ptr as usize },
        312usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::pInAnimatedTextureMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDepthHighRes) as usize - ptr as usize },
        320usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::pInDepthHighRes"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInPositionViewSpace) as usize - ptr as usize },
        328usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::pInPositionViewSpace"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InFrameTimeDeltaInMsec) as usize - ptr as usize },
        336usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::InFrameTimeDeltaInMsec"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInRayTracingHitDistance) as usize - ptr as usize },
        344usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::pInRayTracingHitDistance"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectorsReflections) as usize - ptr as usize },
        352usize,
        "Offset of field: NVSDK_NGX_VK_DLSS_Eval_Params::pInMotionVectorsReflections"
    );
}
impl Default for NVSDK_NGX_VK_DLSS_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_VK_DLISP_Eval_Params {
    pub Feature: NVSDK_NGX_VK_Feature_Eval_Params,
    #[doc = " OPTIONAL - leave to 0/0.0f if unused"]
    pub InRectX: ::std::os::raw::c_uint,
    pub InRectY: ::std::os::raw::c_uint,
    pub InRectW: ::std::os::raw::c_uint,
    pub InRectH: ::std::os::raw::c_uint,
    pub InDenoise: f32,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_VK_DLISP_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_VK_DLISP_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_VK_DLISP_Eval_Params>(),
        48usize,
        "Size of NVSDK_NGX_VK_DLISP_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_VK_DLISP_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_VK_DLISP_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Feature) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_VK_DLISP_Eval_Params::Feature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectX) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_VK_DLISP_Eval_Params::InRectX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectY) as usize - ptr as usize },
        28usize,
        "Offset of field: NVSDK_NGX_VK_DLISP_Eval_Params::InRectY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectW) as usize - ptr as usize },
        32usize,
        "Offset of field: NVSDK_NGX_VK_DLISP_Eval_Params::InRectW"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectH) as usize - ptr as usize },
        36usize,
        "Offset of field: NVSDK_NGX_VK_DLISP_Eval_Params::InRectH"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InDenoise) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_VK_DLISP_Eval_Params::InDenoise"
    );
}
impl Default for NVSDK_NGX_VK_DLISP_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_DLSS_Denoise_Mode {
    NVSDK_NGX_DLSS_Denoise_Mode_Off = 0,
    NVSDK_NGX_DLSS_Denoise_Mode_DLUnified = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_DLSS_Roughness_Mode {
    NVSDK_NGX_DLSS_Roughness_Mode_Unpacked = 0,
    NVSDK_NGX_DLSS_Roughness_Mode_Packed = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_DLSS_Depth_Type {
    NVSDK_NGX_DLSS_Depth_Type_Linear = 0,
    NVSDK_NGX_DLSS_Depth_Type_HW = 1,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_RayReconstruction_Hint_Render_Preset {
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_Default = 0,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_D = 4,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_E = 5,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_F = 6,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_G = 7,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_H = 8,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_I = 9,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_J = 10,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_K = 11,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_L = 12,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_M = 13,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_N = 14,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_O = 15,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_DLSSD_Create_Params {
    pub InDenoiseMode: NVSDK_NGX_DLSS_Denoise_Mode,
    pub InRoughnessMode: NVSDK_NGX_DLSS_Roughness_Mode,
    pub InUseHWDepth: NVSDK_NGX_DLSS_Depth_Type,
    pub InWidth: ::std::os::raw::c_uint,
    pub InHeight: ::std::os::raw::c_uint,
    pub InTargetWidth: ::std::os::raw::c_uint,
    pub InTargetHeight: ::std::os::raw::c_uint,
    #[doc = " OPTIONAL"]
    pub InPerfQualityValue: NVSDK_NGX_PerfQuality_Value,
    pub InFeatureCreateFlags: ::std::os::raw::c_int,
    pub InEnableOutputSubrects: bool,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_DLSSD_Create_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_DLSSD_Create_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_DLSSD_Create_Params>(),
        40usize,
        "Size of NVSDK_NGX_DLSSD_Create_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_DLSSD_Create_Params>(),
        4usize,
        "Alignment of NVSDK_NGX_DLSSD_Create_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InDenoiseMode) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InDenoiseMode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRoughnessMode) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InRoughnessMode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InUseHWDepth) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InUseHWDepth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InWidth) as usize - ptr as usize },
        12usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InWidth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InHeight) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InHeight"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InTargetWidth) as usize - ptr as usize },
        20usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InTargetWidth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InTargetHeight) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InTargetHeight"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InPerfQualityValue) as usize - ptr as usize },
        28usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InPerfQualityValue"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InFeatureCreateFlags) as usize - ptr as usize },
        32usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InFeatureCreateFlags"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InEnableOutputSubrects) as usize - ptr as usize },
        36usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InEnableOutputSubrects"
    );
}
impl Default for NVSDK_NGX_DLSSD_Create_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_VK_DLSSD_Eval_Params {
    pub pInDiffuseAlbedo: *mut NVSDK_NGX_Resource_VK,
    pub pInSpecularAlbedo: *mut NVSDK_NGX_Resource_VK,
    pub pInNormals: *mut NVSDK_NGX_Resource_VK,
    pub pInRoughness: *mut NVSDK_NGX_Resource_VK,
    pub pInColor: *mut NVSDK_NGX_Resource_VK,
    pub pInAlpha: *mut NVSDK_NGX_Resource_VK,
    pub pInOutput: *mut NVSDK_NGX_Resource_VK,
    pub pInOutputAlpha: *mut NVSDK_NGX_Resource_VK,
    pub pInDepth: *mut NVSDK_NGX_Resource_VK,
    pub pInMotionVectors: *mut NVSDK_NGX_Resource_VK,
    pub InJitterOffsetX: f32,
    pub InJitterOffsetY: f32,
    pub InRenderSubrectDimensions: NVSDK_NGX_Dimensions,
    #[doc = " OPTIONAL - leave to 0/0.0f if unused"]
    pub InReset: ::std::os::raw::c_int,
    pub InMVScaleX: f32,
    pub InMVScaleY: f32,
    pub pInTransparencyMask: *mut NVSDK_NGX_Resource_VK,
    pub pInExposureTexture: *mut NVSDK_NGX_Resource_VK,
    pub pInBiasCurrentColorMask: *mut NVSDK_NGX_Resource_VK,
    pub InAlphaSubrectBase: NVSDK_NGX_Coordinates,
    pub InOutputAlphaSubrectBase: NVSDK_NGX_Coordinates,
    pub InDiffuseAlbedoSubrectBase: NVSDK_NGX_Coordinates,
    pub InSpecularAlbedoSubrectBase: NVSDK_NGX_Coordinates,
    pub InNormalsSubrectBase: NVSDK_NGX_Coordinates,
    pub InRoughnessSubrectBase: NVSDK_NGX_Coordinates,
    pub InColorSubrectBase: NVSDK_NGX_Coordinates,
    pub InDepthSubrectBase: NVSDK_NGX_Coordinates,
    pub InMVSubrectBase: NVSDK_NGX_Coordinates,
    pub InTranslucencySubrectBase: NVSDK_NGX_Coordinates,
    pub InBiasCurrentColorSubrectBase: NVSDK_NGX_Coordinates,
    pub InOutputSubrectBase: NVSDK_NGX_Coordinates,
    pub InPreExposure: f32,
    pub InExposureScale: f32,
    pub InIndicatorInvertXAxis: ::std::os::raw::c_int,
    pub InIndicatorInvertYAxis: ::std::os::raw::c_int,
    #[doc = " OPTIONAL - only for research purposes"]
    pub pInReflectedAlbedo: *mut NVSDK_NGX_Resource_VK,
    pub pInColorBeforeParticles: *mut NVSDK_NGX_Resource_VK,
    pub pInColorAfterParticles: *mut NVSDK_NGX_Resource_VK,
    pub pInColorBeforeTransparency: *mut NVSDK_NGX_Resource_VK,
    pub pInColorAfterTransparency: *mut NVSDK_NGX_Resource_VK,
    pub pInColorBeforeFog: *mut NVSDK_NGX_Resource_VK,
    pub pInColorAfterFog: *mut NVSDK_NGX_Resource_VK,
    pub pInScreenSpaceSubsurfaceScatteringGuide: *mut NVSDK_NGX_Resource_VK,
    pub pInColorBeforeScreenSpaceSubsurfaceScattering: *mut NVSDK_NGX_Resource_VK,
    pub pInColorAfterScreenSpaceSubsurfaceScattering: *mut NVSDK_NGX_Resource_VK,
    pub pInScreenSpaceRefractionGuide: *mut NVSDK_NGX_Resource_VK,
    pub pInColorBeforeScreenSpaceRefraction: *mut NVSDK_NGX_Resource_VK,
    pub pInColorAfterScreenSpaceRefraction: *mut NVSDK_NGX_Resource_VK,
    pub pInDepthOfFieldGuide: *mut NVSDK_NGX_Resource_VK,
    pub pInColorBeforeDepthOfField: *mut NVSDK_NGX_Resource_VK,
    pub pInColorAfterDepthOfField: *mut NVSDK_NGX_Resource_VK,
    pub pInDiffuseHitDistance: *mut NVSDK_NGX_Resource_VK,
    pub pInSpecularHitDistance: *mut NVSDK_NGX_Resource_VK,
    pub pInDiffuseRayDirection: *mut NVSDK_NGX_Resource_VK,
    pub pInSpecularRayDirection: *mut NVSDK_NGX_Resource_VK,
    pub pInDiffuseRayDirectionHitDistance: *mut NVSDK_NGX_Resource_VK,
    pub pInSpecularRayDirectionHitDistance: *mut NVSDK_NGX_Resource_VK,
    pub InReflectedAlbedoSubrectBase: NVSDK_NGX_Coordinates,
    pub InColorBeforeParticlesSubrectBase: NVSDK_NGX_Coordinates,
    pub InColorAfterParticlesSubrectBase: NVSDK_NGX_Coordinates,
    pub InColorBeforeTransparencySubrectBase: NVSDK_NGX_Coordinates,
    pub InColorAfterTransparencySubrectBase: NVSDK_NGX_Coordinates,
    pub InColorBeforeFogSubrectBase: NVSDK_NGX_Coordinates,
    pub InColorAfterFogSubrectBase: NVSDK_NGX_Coordinates,
    pub InScreenSpaceSubsurfaceScatteringGuideSubrectBase: NVSDK_NGX_Coordinates,
    pub InColorBeforeScreenSpaceSubsurfaceScatteringSubrectBase: NVSDK_NGX_Coordinates,
    pub InColorAfterScreenSpaceSubsurfaceScatteringSubrectBase: NVSDK_NGX_Coordinates,
    pub InScreenSpaceRefractionGuideSubrectBase: NVSDK_NGX_Coordinates,
    pub InColorBeforeScreenSpaceRefractionSubrectBase: NVSDK_NGX_Coordinates,
    pub InColorAfterScreenSpaceRefractionSubrectBase: NVSDK_NGX_Coordinates,
    pub InDepthOfFieldGuideSubrectBase: NVSDK_NGX_Coordinates,
    pub InColorBeforeDepthOfFieldSubrectBase: NVSDK_NGX_Coordinates,
    pub InColorAfterDepthOfFieldSubrectBase: NVSDK_NGX_Coordinates,
    pub InDiffuseHitDistanceSubrectBase: NVSDK_NGX_Coordinates,
    pub InSpecularHitDistanceSubrectBase: NVSDK_NGX_Coordinates,
    pub InDiffuseRayDirectionSubrectBase: NVSDK_NGX_Coordinates,
    pub InSpecularRayDirectionSubrectBase: NVSDK_NGX_Coordinates,
    pub InDiffuseRayDirectionHitDistanceSubrectBase: NVSDK_NGX_Coordinates,
    pub InSpecularRayDirectionHitDistanceSubrectBase: NVSDK_NGX_Coordinates,
    pub pInWorldToViewMatrix: *mut f32,
    pub pInViewToClipMatrix: *mut f32,
    pub GBufferSurface: NVSDK_NGX_VK_GBuffer,
    pub InToneMapperType: NVSDK_NGX_ToneMapperType,
    pub pInMotionVectors3D: *mut NVSDK_NGX_Resource_VK,
    pub pInIsParticleMask: *mut NVSDK_NGX_Resource_VK,
    pub pInAnimatedTextureMask: *mut NVSDK_NGX_Resource_VK,
    pub pInDepthHighRes: *mut NVSDK_NGX_Resource_VK,
    pub pInPositionViewSpace: *mut NVSDK_NGX_Resource_VK,
    pub InFrameTimeDeltaInMsec: f32,
    pub pInRayTracingHitDistance: *mut NVSDK_NGX_Resource_VK,
    pub pInMotionVectorsReflections: *mut NVSDK_NGX_Resource_VK,
    pub pInTransparencyLayer: *mut NVSDK_NGX_Resource_VK,
    pub InTransparencyLayerSubrectBase: NVSDK_NGX_Coordinates,
    pub pInTransparencyLayerOpacity: *mut NVSDK_NGX_Resource_VK,
    pub InTransparencyLayerOpacitySubrectBase: NVSDK_NGX_Coordinates,
    pub pInTransparencyLayerMvecs: *mut NVSDK_NGX_Resource_VK,
    pub InTransparencyLayerMvecsSubrectBase: NVSDK_NGX_Coordinates,
    pub pInDisocclusionMask: *mut NVSDK_NGX_Resource_VK,
    pub InDisocclusionMaskSubrectBase: NVSDK_NGX_Coordinates,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_VK_DLSSD_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_VK_DLSSD_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_VK_DLSSD_Eval_Params>(),
        880usize,
        "Size of NVSDK_NGX_VK_DLSSD_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_VK_DLSSD_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_VK_DLSSD_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDiffuseAlbedo) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInDiffuseAlbedo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInSpecularAlbedo) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInSpecularAlbedo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInNormals) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInNormals"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInRoughness) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInRoughness"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColor) as usize - ptr as usize },
        32usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInColor"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInAlpha) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInAlpha"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInOutput) as usize - ptr as usize },
        48usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInOutput"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInOutputAlpha) as usize - ptr as usize },
        56usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInOutputAlpha"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDepth) as usize - ptr as usize },
        64usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInDepth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectors) as usize - ptr as usize },
        72usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInMotionVectors"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InJitterOffsetX) as usize - ptr as usize },
        80usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InJitterOffsetX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InJitterOffsetY) as usize - ptr as usize },
        84usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InJitterOffsetY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRenderSubrectDimensions) as usize - ptr as usize },
        88usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InRenderSubrectDimensions"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InReset) as usize - ptr as usize },
        96usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InReset"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVScaleX) as usize - ptr as usize },
        100usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InMVScaleX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVScaleY) as usize - ptr as usize },
        104usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InMVScaleY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInTransparencyMask) as usize - ptr as usize },
        112usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInTransparencyMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInExposureTexture) as usize - ptr as usize },
        120usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInExposureTexture"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInBiasCurrentColorMask) as usize - ptr as usize },
        128usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInBiasCurrentColorMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InAlphaSubrectBase) as usize - ptr as usize },
        136usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InAlphaSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InOutputAlphaSubrectBase) as usize - ptr as usize },
        144usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InOutputAlphaSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InDiffuseAlbedoSubrectBase) as usize - ptr as usize },
        152usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InDiffuseAlbedoSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InSpecularAlbedoSubrectBase) as usize - ptr as usize },
        160usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InSpecularAlbedoSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InNormalsSubrectBase) as usize - ptr as usize },
        168usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InNormalsSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRoughnessSubrectBase) as usize - ptr as usize },
        176usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InRoughnessSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InColorSubrectBase) as usize - ptr as usize },
        184usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InColorSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InDepthSubrectBase) as usize - ptr as usize },
        192usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InDepthSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVSubrectBase) as usize - ptr as usize },
        200usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InMVSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InTranslucencySubrectBase) as usize - ptr as usize },
        208usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InTranslucencySubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InBiasCurrentColorSubrectBase) as usize - ptr as usize
        },
        216usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InBiasCurrentColorSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InOutputSubrectBase) as usize - ptr as usize },
        224usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InOutputSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InPreExposure) as usize - ptr as usize },
        232usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InPreExposure"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InExposureScale) as usize - ptr as usize },
        236usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InExposureScale"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InIndicatorInvertXAxis) as usize - ptr as usize },
        240usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InIndicatorInvertXAxis"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InIndicatorInvertYAxis) as usize - ptr as usize },
        244usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InIndicatorInvertYAxis"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInReflectedAlbedo) as usize - ptr as usize },
        248usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInReflectedAlbedo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColorBeforeParticles) as usize - ptr as usize },
        256usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInColorBeforeParticles"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColorAfterParticles) as usize - ptr as usize },
        264usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInColorAfterParticles"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColorBeforeTransparency) as usize - ptr as usize },
        272usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInColorBeforeTransparency"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColorAfterTransparency) as usize - ptr as usize },
        280usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInColorAfterTransparency"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColorBeforeFog) as usize - ptr as usize },
        288usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInColorBeforeFog"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColorAfterFog) as usize - ptr as usize },
        296usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInColorAfterFog"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).pInScreenSpaceSubsurfaceScatteringGuide) as usize
                - ptr as usize
        },
        304usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInScreenSpaceSubsurfaceScatteringGuide"
    );
    assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . pInColorBeforeScreenSpaceSubsurfaceScattering) as usize - ptr as usize } , 312usize , "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInColorBeforeScreenSpaceSubsurfaceScattering");
    assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . pInColorAfterScreenSpaceSubsurfaceScattering) as usize - ptr as usize } , 320usize , "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInColorAfterScreenSpaceSubsurfaceScattering");
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).pInScreenSpaceRefractionGuide) as usize - ptr as usize
        },
        328usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInScreenSpaceRefractionGuide"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).pInColorBeforeScreenSpaceRefraction) as usize - ptr as usize
        },
        336usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInColorBeforeScreenSpaceRefraction"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).pInColorAfterScreenSpaceRefraction) as usize - ptr as usize
        },
        344usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInColorAfterScreenSpaceRefraction"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDepthOfFieldGuide) as usize - ptr as usize },
        352usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInDepthOfFieldGuide"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColorBeforeDepthOfField) as usize - ptr as usize },
        360usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInColorBeforeDepthOfField"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColorAfterDepthOfField) as usize - ptr as usize },
        368usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInColorAfterDepthOfField"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDiffuseHitDistance) as usize - ptr as usize },
        376usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInDiffuseHitDistance"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInSpecularHitDistance) as usize - ptr as usize },
        384usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInSpecularHitDistance"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDiffuseRayDirection) as usize - ptr as usize },
        392usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInDiffuseRayDirection"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInSpecularRayDirection) as usize - ptr as usize },
        400usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInSpecularRayDirection"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).pInDiffuseRayDirectionHitDistance) as usize - ptr as usize
        },
        408usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInDiffuseRayDirectionHitDistance"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).pInSpecularRayDirectionHitDistance) as usize - ptr as usize
        },
        416usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInSpecularRayDirectionHitDistance"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InReflectedAlbedoSubrectBase) as usize - ptr as usize
        },
        424usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InReflectedAlbedoSubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InColorBeforeParticlesSubrectBase) as usize - ptr as usize
        },
        432usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InColorBeforeParticlesSubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InColorAfterParticlesSubrectBase) as usize - ptr as usize
        },
        440usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InColorAfterParticlesSubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InColorBeforeTransparencySubrectBase) as usize
                - ptr as usize
        },
        448usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InColorBeforeTransparencySubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InColorAfterTransparencySubrectBase) as usize - ptr as usize
        },
        456usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InColorAfterTransparencySubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InColorBeforeFogSubrectBase) as usize - ptr as usize },
        464usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InColorBeforeFogSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InColorAfterFogSubrectBase) as usize - ptr as usize },
        472usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InColorAfterFogSubrectBase"
    );
    assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . InScreenSpaceSubsurfaceScatteringGuideSubrectBase) as usize - ptr as usize } , 480usize , "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InScreenSpaceSubsurfaceScatteringGuideSubrectBase");
    assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . InColorBeforeScreenSpaceSubsurfaceScatteringSubrectBase) as usize - ptr as usize } , 488usize , "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InColorBeforeScreenSpaceSubsurfaceScatteringSubrectBase");
    assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . InColorAfterScreenSpaceSubsurfaceScatteringSubrectBase) as usize - ptr as usize } , 496usize , "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InColorAfterScreenSpaceSubsurfaceScatteringSubrectBase");
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InScreenSpaceRefractionGuideSubrectBase) as usize
                - ptr as usize
        },
        504usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InScreenSpaceRefractionGuideSubrectBase"
    );
    assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . InColorBeforeScreenSpaceRefractionSubrectBase) as usize - ptr as usize } , 512usize , "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InColorBeforeScreenSpaceRefractionSubrectBase");
    assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . InColorAfterScreenSpaceRefractionSubrectBase) as usize - ptr as usize } , 520usize , "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InColorAfterScreenSpaceRefractionSubrectBase");
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InDepthOfFieldGuideSubrectBase) as usize - ptr as usize
        },
        528usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InDepthOfFieldGuideSubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InColorBeforeDepthOfFieldSubrectBase) as usize
                - ptr as usize
        },
        536usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InColorBeforeDepthOfFieldSubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InColorAfterDepthOfFieldSubrectBase) as usize - ptr as usize
        },
        544usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InColorAfterDepthOfFieldSubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InDiffuseHitDistanceSubrectBase) as usize - ptr as usize
        },
        552usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InDiffuseHitDistanceSubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InSpecularHitDistanceSubrectBase) as usize - ptr as usize
        },
        560usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InSpecularHitDistanceSubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InDiffuseRayDirectionSubrectBase) as usize - ptr as usize
        },
        568usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InDiffuseRayDirectionSubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InSpecularRayDirectionSubrectBase) as usize - ptr as usize
        },
        576usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InSpecularRayDirectionSubrectBase"
    );
    assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . InDiffuseRayDirectionHitDistanceSubrectBase) as usize - ptr as usize } , 584usize , "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InDiffuseRayDirectionHitDistanceSubrectBase");
    assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . InSpecularRayDirectionHitDistanceSubrectBase) as usize - ptr as usize } , 592usize , "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InSpecularRayDirectionHitDistanceSubrectBase");
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInWorldToViewMatrix) as usize - ptr as usize },
        600usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInWorldToViewMatrix"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInViewToClipMatrix) as usize - ptr as usize },
        608usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInViewToClipMatrix"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GBufferSurface) as usize - ptr as usize },
        616usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::GBufferSurface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InToneMapperType) as usize - ptr as usize },
        744usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InToneMapperType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectors3D) as usize - ptr as usize },
        752usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInMotionVectors3D"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInIsParticleMask) as usize - ptr as usize },
        760usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInIsParticleMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInAnimatedTextureMask) as usize - ptr as usize },
        768usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInAnimatedTextureMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDepthHighRes) as usize - ptr as usize },
        776usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInDepthHighRes"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInPositionViewSpace) as usize - ptr as usize },
        784usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInPositionViewSpace"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InFrameTimeDeltaInMsec) as usize - ptr as usize },
        792usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InFrameTimeDeltaInMsec"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInRayTracingHitDistance) as usize - ptr as usize },
        800usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInRayTracingHitDistance"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectorsReflections) as usize - ptr as usize },
        808usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInMotionVectorsReflections"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInTransparencyLayer) as usize - ptr as usize },
        816usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInTransparencyLayer"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InTransparencyLayerSubrectBase) as usize - ptr as usize
        },
        824usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InTransparencyLayerSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInTransparencyLayerOpacity) as usize - ptr as usize },
        832usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInTransparencyLayerOpacity"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InTransparencyLayerOpacitySubrectBase) as usize
                - ptr as usize
        },
        840usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InTransparencyLayerOpacitySubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInTransparencyLayerMvecs) as usize - ptr as usize },
        848usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInTransparencyLayerMvecs"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InTransparencyLayerMvecsSubrectBase) as usize - ptr as usize
        },
        856usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InTransparencyLayerMvecsSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDisocclusionMask) as usize - ptr as usize },
        864usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::pInDisocclusionMask"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InDisocclusionMaskSubrectBase) as usize - ptr as usize
        },
        872usize,
        "Offset of field: NVSDK_NGX_VK_DLSSD_Eval_Params::InDisocclusionMaskSubrectBase"
    );
}
impl Default for NVSDK_NGX_VK_DLSSD_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_DLSSG_EvalFlags {
    NVSDK_NGX_DLSSG_EvalFlags_UpdateOnlyInsideExtents = 1,
}
pub type PFN_NVSDK_NGX_DLSSG_GetCurrentSettingsCallback = ::std::option::Option<
    unsafe extern "C" fn(
        InHandle: *const NVSDK_NGX_Handle,
        InParams: *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result,
>;
pub type PFN_NVSDK_NGX_DLSSG_EstimateVRAMCallback = ::std::option::Option<
    unsafe extern "C" fn(
        mvecDepthWidth: u32,
        mvecDepthHeight: u32,
        colorWidth: u32,
        colorHeight: u32,
        colorBufferFormat: u32,
        mvecBufferFormat: u32,
        depthBufferFormat: u32,
        hudLessBufferFormat: u32,
        uiBufferFormat: u32,
        estimatedVRAMInBytes: *mut usize,
    ) -> NVSDK_NGX_Result,
>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NVSDK_NGX_DLSSG_Create_Params {
    pub Width: ::std::os::raw::c_uint,
    pub Height: ::std::os::raw::c_uint,
    pub NativeBackbufferFormat: ::std::os::raw::c_uint,
    pub RenderWidth: ::std::os::raw::c_uint,
    pub RenderHeight: ::std::os::raw::c_uint,
    pub DynamicResolutionScaling: bool,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_DLSSG_Create_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_DLSSG_Create_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_DLSSG_Create_Params>(),
        24usize,
        "Size of NVSDK_NGX_DLSSG_Create_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_DLSSG_Create_Params>(),
        4usize,
        "Alignment of NVSDK_NGX_DLSSG_Create_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Width) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_DLSSG_Create_Params::Width"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Height) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_DLSSG_Create_Params::Height"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NativeBackbufferFormat) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_DLSSG_Create_Params::NativeBackbufferFormat"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RenderWidth) as usize - ptr as usize },
        12usize,
        "Offset of field: NVSDK_NGX_DLSSG_Create_Params::RenderWidth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RenderHeight) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_DLSSG_Create_Params::RenderHeight"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DynamicResolutionScaling) as usize - ptr as usize },
        20usize,
        "Offset of field: NVSDK_NGX_DLSSG_Create_Params::DynamicResolutionScaling"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_DLSSG_Opt_Eval_Params {
    #[doc = "! Number of intermediate frames to generate between rendered frames\n! (1 = 2x, 2 = 3x, etc.)"]
    pub multiFrameCount: ::std::os::raw::c_uint,
    #[doc = "! The index (starting at 1) of the intermediate frame being generated, up\n! to multiFrameCount (inclusive)"]
    pub multiFrameIndex: ::std::os::raw::c_uint,
    #[doc = "! IMPORTANT: All matrices should NOT contain temporal AA jitter offset\n! Specifies matrix transformation from the camera view to the clip space."]
    pub cameraViewToClip: [[f32; 4usize]; 4usize],
    #[doc = "! Specifies matrix transformation from the clip space to the camera view space."]
    pub clipToCameraView: [[f32; 4usize]; 4usize],
    #[doc = "! Specifies matrix transformation describing lens distortion in clip space."]
    pub clipToLensClip: [[f32; 4usize]; 4usize],
    #[doc = "! Specifies matrix transformation from the current clip to the previous clip space."]
    pub clipToPrevClip: [[f32; 4usize]; 4usize],
    #[doc = "! Specifies matrix transformation from the previous clip to the current clip space."]
    pub prevClipToClip: [[f32; 4usize]; 4usize],
    #[doc = "! Specifies clip space jitter offset"]
    pub jitterOffset: [f32; 2usize],
    #[doc = "! Specifies scale factors used to normalize motion vectors (so the values are in [-1,1] range)"]
    pub mvecScale: [f32; 2usize],
    #[doc = "! Specifies camera pinhole offset."]
    pub cameraPinholeOffset: [f32; 2usize],
    #[doc = "! Specifies camera position in world space."]
    pub cameraPos: [f32; 3usize],
    #[doc = "! Specifies camera up vector in world space."]
    pub cameraUp: [f32; 3usize],
    #[doc = "! Specifies camera right vector in world space."]
    pub cameraRight: [f32; 3usize],
    #[doc = "! Specifies camera forward vector in world space."]
    pub cameraFwd: [f32; 3usize],
    #[doc = "! Specifies camera near view plane distance."]
    pub cameraNear: f32,
    #[doc = "! Specifies camera far view plane distance."]
    pub cameraFar: f32,
    #[doc = "! Specifies camera field of view in radians."]
    pub cameraFOV: f32,
    #[doc = "! Specifies camera aspect ratio defined as view space width divided by height."]
    pub cameraAspectRatio: f32,
    #[doc = "! Specifies if tagged color buffers are full HDR (rendering to an HDR monitor) or not"]
    pub colorBuffersHDR: bool,
    #[doc = "! Specifies if depth values are inverted (value closer to the camera is higher) or not."]
    pub depthInverted: bool,
    #[doc = "! Specifies if camera motion is included in the MVec buffer."]
    pub cameraMotionIncluded: bool,
    #[doc = "! Specifies if previous frame has no connection to the current one (motion vectors are invalid)"]
    pub reset: bool,
    #[doc = "! Specifies if Automode overrode the input Reset flag to true."]
    pub automodeOverrideReset: bool,
    #[doc = "! Specifies if application is not currently rendering game frames (paused in menu, playing video cut-scenes)"]
    pub notRenderingGameFrames: bool,
    #[doc = "! Specifies if orthographic projection is used or not."]
    pub orthoProjection: bool,
    #[doc = "! Specifies which value represents an invalid (un-initialized) value in the motion vectors buffer"]
    pub motionVectorsInvalidValue: f32,
    #[doc = "! Specifies if motion vectors are already dilated or not."]
    pub motionVectorsDilated: bool,
    #[doc = "! Specifies whether or not fullscreen menu detection should be run"]
    pub menuDetectionEnabled: bool,
    pub mvecsSubrectBase: NVSDK_NGX_Coordinates,
    pub mvecsSubrectSize: NVSDK_NGX_Dimensions,
    pub depthSubrectBase: NVSDK_NGX_Coordinates,
    pub depthSubrectSize: NVSDK_NGX_Dimensions,
    pub hudLessSubrectBase: NVSDK_NGX_Coordinates,
    pub hudLessSubrectSize: NVSDK_NGX_Dimensions,
    pub uiSubrectBase: NVSDK_NGX_Coordinates,
    pub uiSubrectSize: NVSDK_NGX_Dimensions,
    pub bidirectionalDistFieldSubrectBase: NVSDK_NGX_Coordinates,
    pub bidirectionalDistFieldSubrectSize: NVSDK_NGX_Dimensions,
    pub bidirectionalDistFieldPrecisionInfo: NVSDK_NGX_PrecisionInfo,
    #[doc = "! Optional heuristic that specifies the minimum depth difference between two objects in screen-space.\n! See comment above NVSDK_NGX_DLSSG_Parameter_MinRelativeLinearDepthObjectSeparation for details."]
    pub minRelativeLinearDepthObjectSeparation: f32,
    pub backbufferSubrectBase: NVSDK_NGX_Coordinates,
    pub backbufferSubrectSize: NVSDK_NGX_Dimensions,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_DLSSG_Opt_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_DLSSG_Opt_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_DLSSG_Opt_Eval_Params>(),
        544usize,
        "Size of NVSDK_NGX_DLSSG_Opt_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_DLSSG_Opt_Eval_Params>(),
        4usize,
        "Alignment of NVSDK_NGX_DLSSG_Opt_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).multiFrameCount) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::multiFrameCount"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).multiFrameIndex) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::multiFrameIndex"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraViewToClip) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::cameraViewToClip"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clipToCameraView) as usize - ptr as usize },
        72usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::clipToCameraView"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clipToLensClip) as usize - ptr as usize },
        136usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::clipToLensClip"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clipToPrevClip) as usize - ptr as usize },
        200usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::clipToPrevClip"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prevClipToClip) as usize - ptr as usize },
        264usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::prevClipToClip"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jitterOffset) as usize - ptr as usize },
        328usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::jitterOffset"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mvecScale) as usize - ptr as usize },
        336usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::mvecScale"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraPinholeOffset) as usize - ptr as usize },
        344usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::cameraPinholeOffset"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraPos) as usize - ptr as usize },
        352usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::cameraPos"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraUp) as usize - ptr as usize },
        364usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::cameraUp"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraRight) as usize - ptr as usize },
        376usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::cameraRight"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraFwd) as usize - ptr as usize },
        388usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::cameraFwd"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraNear) as usize - ptr as usize },
        400usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::cameraNear"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraFar) as usize - ptr as usize },
        404usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::cameraFar"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraFOV) as usize - ptr as usize },
        408usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::cameraFOV"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraAspectRatio) as usize - ptr as usize },
        412usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::cameraAspectRatio"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colorBuffersHDR) as usize - ptr as usize },
        416usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::colorBuffersHDR"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).depthInverted) as usize - ptr as usize },
        417usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::depthInverted"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cameraMotionIncluded) as usize - ptr as usize },
        418usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::cameraMotionIncluded"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reset) as usize - ptr as usize },
        419usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::reset"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).automodeOverrideReset) as usize - ptr as usize },
        420usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::automodeOverrideReset"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).notRenderingGameFrames) as usize - ptr as usize },
        421usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::notRenderingGameFrames"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).orthoProjection) as usize - ptr as usize },
        422usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::orthoProjection"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).motionVectorsInvalidValue) as usize - ptr as usize },
        424usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::motionVectorsInvalidValue"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).motionVectorsDilated) as usize - ptr as usize },
        428usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::motionVectorsDilated"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).menuDetectionEnabled) as usize - ptr as usize },
        429usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::menuDetectionEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mvecsSubrectBase) as usize - ptr as usize },
        432usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::mvecsSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mvecsSubrectSize) as usize - ptr as usize },
        440usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::mvecsSubrectSize"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).depthSubrectBase) as usize - ptr as usize },
        448usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::depthSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).depthSubrectSize) as usize - ptr as usize },
        456usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::depthSubrectSize"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hudLessSubrectBase) as usize - ptr as usize },
        464usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::hudLessSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hudLessSubrectSize) as usize - ptr as usize },
        472usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::hudLessSubrectSize"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiSubrectBase) as usize - ptr as usize },
        480usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::uiSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiSubrectSize) as usize - ptr as usize },
        488usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::uiSubrectSize"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).bidirectionalDistFieldSubrectBase) as usize - ptr as usize
        },
        496usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::bidirectionalDistFieldSubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).bidirectionalDistFieldSubrectSize) as usize - ptr as usize
        },
        504usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::bidirectionalDistFieldSubrectSize"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).bidirectionalDistFieldPrecisionInfo) as usize - ptr as usize
        },
        512usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::bidirectionalDistFieldPrecisionInfo"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).minRelativeLinearDepthObjectSeparation) as usize
                - ptr as usize
        },
        524usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::minRelativeLinearDepthObjectSeparation"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).backbufferSubrectBase) as usize - ptr as usize },
        528usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::backbufferSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).backbufferSubrectSize) as usize - ptr as usize },
        536usize,
        "Offset of field: NVSDK_NGX_DLSSG_Opt_Eval_Params::backbufferSubrectSize"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_VK_DLSSG_Eval_Params {
    pub pBackbuffer: *mut NVSDK_NGX_Resource_VK,
    pub pDepth: *mut NVSDK_NGX_Resource_VK,
    pub pMVecs: *mut NVSDK_NGX_Resource_VK,
    pub pHudless: *mut NVSDK_NGX_Resource_VK,
    pub pUI: *mut NVSDK_NGX_Resource_VK,
    pub pNoPostProcessingColor: *mut NVSDK_NGX_Resource_VK,
    pub pBidirectionalDistortionField: *mut NVSDK_NGX_Resource_VK,
    pub pOutputInterpFrame: *mut NVSDK_NGX_Resource_VK,
    pub pOutputRealFrame: *mut NVSDK_NGX_Resource_VK,
    pub pOutputDisableInterpolation: *mut NVSDK_NGX_Resource_VK,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_VK_DLSSG_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_VK_DLSSG_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_VK_DLSSG_Eval_Params>(),
        80usize,
        "Size of NVSDK_NGX_VK_DLSSG_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_VK_DLSSG_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_VK_DLSSG_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pBackbuffer) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_VK_DLSSG_Eval_Params::pBackbuffer"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pDepth) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_VK_DLSSG_Eval_Params::pDepth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pMVecs) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_VK_DLSSG_Eval_Params::pMVecs"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pHudless) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_VK_DLSSG_Eval_Params::pHudless"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pUI) as usize - ptr as usize },
        32usize,
        "Offset of field: NVSDK_NGX_VK_DLSSG_Eval_Params::pUI"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pNoPostProcessingColor) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_VK_DLSSG_Eval_Params::pNoPostProcessingColor"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).pBidirectionalDistortionField) as usize - ptr as usize
        },
        48usize,
        "Offset of field: NVSDK_NGX_VK_DLSSG_Eval_Params::pBidirectionalDistortionField"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pOutputInterpFrame) as usize - ptr as usize },
        56usize,
        "Offset of field: NVSDK_NGX_VK_DLSSG_Eval_Params::pOutputInterpFrame"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pOutputRealFrame) as usize - ptr as usize },
        64usize,
        "Offset of field: NVSDK_NGX_VK_DLSSG_Eval_Params::pOutputRealFrame"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pOutputDisableInterpolation) as usize - ptr as usize },
        72usize,
        "Offset of field: NVSDK_NGX_VK_DLSSG_Eval_Params::pOutputDisableInterpolation"
    );
}
impl Default for NVSDK_NGX_VK_DLSSG_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    #[link_name = "\u{1}_Z37HELPERS_NGX_DLSS_GET_OPTIMAL_SETTINGSP19NVSDK_NGX_Parameterjj27NVSDK_NGX_PerfQuality_ValuePjS2_S2_S2_S2_S2_Pf"]
    pub fn HELPERS_NGX_DLSS_GET_OPTIMAL_SETTINGS(
        pInParams: *mut NVSDK_NGX_Parameter,
        InUserSelectedWidth: ::std::os::raw::c_uint,
        InUserSelectedHeight: ::std::os::raw::c_uint,
        InPerfQualityValue: NVSDK_NGX_PerfQuality_Value,
        pOutRenderOptimalWidth: *mut ::std::os::raw::c_uint,
        pOutRenderOptimalHeight: *mut ::std::os::raw::c_uint,
        pOutRenderMaxWidth: *mut ::std::os::raw::c_uint,
        pOutRenderMaxHeight: *mut ::std::os::raw::c_uint,
